# lab_01_2
# Цель
# 1 Рассчитать значение f при заданном значении вещественного числа x: При выводе на экран оставьте 2 знака после запятой.
```
x = float(input())
if x >= 0:
    f = x**0.5 + x **2
else:
    f = 1 / x

print(round(f,2))
```
# 2 Определите максимальное и минимальное значения из двух различных целых чисел.
```
a1 = int(input("Введите первое число: "))
a2 = int(input("Введите первое число: "))

# Переменная 'a_min' должна содержать минимум, 'a_max' - максимум
if a1 > a2:
  a_min = a2
  a_max = a1
else:
  a_min = a1
  a_max = a2
print(f"Минимальное значение: {a_min}, максимальное значение: {a_max}")
```
# 3 Вася пытается высунуть голову в форточку размерами a и b см. Приняв условно, что его голова - круглая диаметром d см, определите, сможет ли Вася сделать это. Для прохождения головы в форточку необходим зазор в 1 см. с каждой стороны. Все величины - целые числа.
```
a = int(input("Ширина форточки: "))
b = int(input("Высота форточки: "))
d = int(input("Диаметр головы: "))

# Введенные числа должны быть положительными, если так - осуществляем
# расчет, иначе выводим "Проверьте ввод"

if a < 0 or b < 0 or d < 0:
  print ("Проверьте ввод")

if d + 2 <= a and d + 2 <= b:
  print ("Да")
else:
  print ("Нет")
```
# 4 Известны год и номер месяца сегодняшнего дня, а также год и номер месяца рождения человека (нумерация месяцев с 1: январь - 1 и т.д.). Определите возраст человека (число полных лет).
```
year_today = int(input("Введите текущий год: "))
month_today = int(input("Введите текущий месяц: "))

year = int(input("Введите год рождения: "))
month = int(input("Введите месяц рождения: "))

# Результат необходимо записать в переменную 'age'

if month_today >= month:
  age = year_today - year
else:
  age = year_today - year - 1
print("Число полных лет: ", age)
```
# 5 Дана точка с целыми ненулевыми координатами (x;y). Определить номер четверти координатной плоскости, которой она принадлежит.
```
x = int(input("Введите координату x: "))
y = int(input("Введите координату y: "))

if x > 0 and y > 0:
  print("1-я четверть")
elif x < 0 and y > 0:
  print("2-я четверть")
elif x < 0 and y < 0:
  print("3-я четверть")
else:
  print("4-я четверть")
```
# 6 Даны вещественные числа a, b, c (a≠0). Решите уравнение ax2+bx+c=0. При выводе значений оставьте 1 знак после запятой.
```
a = float(input("Введите a: "))
b = float(input("Введите b: "))
c = float(input("Введите c: "))
d = b**2 - (4 * a * c)
if d < 0:  
print("Нет корней")
elif d == 0:  
x = - b / 2 * a  
print(round(x, 1))
else:  
x_1 = (- b - d**0.5) /(2 * a)  
x_2 = (- b + d**0.5) /(2 * a)
  print(round(x_1, 1))  
print(round(x_2, 1))
```
# 7 Дана непустая последовательность целых чисел, оканчивающаяся нулем. Найти
сумму и количество введенных чисел.
```
nums_sum = 0  # сумма
nums_count = 0  # количество
x = int(input("Введите последовательность: "))
while x != 0:  
nums_sum += x % 10  
nums_count += 1  
x = x // 10
print(f"Сумма: {nums_sum}, количество: {nums_count}")
```
# 8 Дано число n. Из чисел 0,5,10,15,20,25,... напечатать те, которые не превышают n.
```
n = int(input("Введите число: "))
for i in range(0, n+1, 5):  
print(i)
```
# 9 Дано вещественное число a. Найдите наименьшее натуральное n, для которого
верно
```
a = float(input())
n= 0
while a >= 0:  
n +=1  
a = a - (1/n)
print (n)
```
# 10 Дано натуральное число. Определите сумму и количество его цифр
```
n = int(input("Введите значение: "))
n_sum = 0
n_count = 0
while n > 0 :  
n_sum += n % 10  
n_count += 1  
n = n//10
print(f"Сумма цифр: {n_sum}, количество цифр: {n_count}" )
```
# 11 Вывести в строку 10 первых натуральных чисел, оканчивающихся на цифру k, кратных числу s и находящихся в интервале, левая граница которого равна start.
```
start = int(input("Введите стартовое значение: "))
k = int(input("Введите конечное значение: "))
s = int(input("Введите значение делителя: "))
n_count = 0
c = 1
res = []
while n_count < 10:    
if c % s == 0 and c % 10 == k and c > start:      
res.append(str(c))      
n_c ount += 1    
c += 1
print(" ".join(res))
```
# 12 Даны целые числа a и b (a может быть больше b). Напечатайте:
